//
// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//

let x = +prompt('ВВЕДІТЬ ЧИСЛО');

if (x !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = +prompt('ВВЕДІТЬ ЧАС');

if (0 <= time <= 15) {
    console.log('ПЕРША ЧАСТИНА ГОДИНИ');
} else if (15 < time <= 30) {
    console.log('ДРУГА ЧАСТИНА ГОДИНИ');
} else if (30 < time <= 45) {
    console.log('ТРЕТЯ ЧАСТИНА ГОДИНИ');
} else if (45 < time <= 60) {
    console.log('ЧЕТВЕРТА ЧАСТИНА ГОДИНИ');
}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//

let day = +prompt('ВВЕДІТЬ ЧИСЛО');

if (1 <= day <= 10) {
    console.log('ПЕРША ДЕКАДА');
} else if (10 < time <= 20) {
    console.log('ДРУГА ДЕКАДА');
} else if (20 < time <= 31) {
    console.log('ТРЕТЯ ДЕКАДА');
}

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
// що заплановано на цей день (можна замість плану на день, назву дня англійською).

let w = +prompt('ВВЕДІТЬ ПОРЯДКОВИЙ НОМЕР ДНЯ ТИЖНЯ');

switch (w) {
    case 1:
        console.log("SUNDAY");
        break;
    case 2:
        console.log("MONDAY");
        break;
    case 3:
        console.log("TUESDAY");
        break;
    case 4:
        console.log("WEDNESDAY");
        break;
    case 5:
        console.log("THURSDAY");
        break;
    case 6:
        console.log("FRIDAY");
        break;
    case 7:
        console.log("SATURDAY");
        break;
    default:
        console.log("Sorry, this is a mistake!");
}

//
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.


let x1 = +prompt('ВВЕДІТЬ ПЕРШЕ ЧИСЛО');
let x2 = +prompt('ВВЕДІТЬ ДРУГЕ ЧИСЛО');

if (x1 > x2) {
    console.log('ПЕРШЕ ЧИСЛО БІЛЬШЕ');
} else if (x2 > x1) {
    console.log('ДРУГЕ ЧИСЛО БІЛЬШЕ');
} else if (x1 === x2) {
    console.log('ОБИДВА ЧИСЛА РІВНІ');
}

//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy
//         (хибноподыбне, тобто кастується до false)
//

let xx = prompt('ВВЕДІТЬ БУДЬ-ЯКЕ ЗНАЧЕННЯ') || 'default';
console.log(xx);
